#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 13: Claw Contraption
#+AUTHOR: Michael R. Mauger
#+DATE: [Wed Dec 18 14:37:35 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  LOAD_FILE=example.dat sqlite3 < claw-contraption.sql
  LOAD_FILE=input.dat   sqlite3 < claw-contraption.sql
#+END_SRC

#+RESULTS:
#+begin_example

CREATE TABLE game
(   game_id             INT
,   button_a_x          INT
,   button_a_y          INT
,   button_b_x          INT
,   button_b_y          INT
,   prize_x             INT
,   prize_y             INT
);
Run Time: real 0.000 user 0.000000 sys 0.000198
changes: 0   total_changes: 0

.import --csv '| awk -f load-game.awk $LOAD_FILE' game
SELECT COUNT (*) FROM game;
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 4         │
└───────────┘
Run Time: real 0.000 user 0.000000 sys 0.000027
changes: 1   total_changes: 4

CREATE VIEW solution
AS
SELECT
    g.game_id
,   na.VALUE  AS n
,   (g.prize_x - g.button_a_x * na.VALUE) / g.button_b_x  AS m
FROM
    game  AS g
CROSS JOIN
    GENERATE_SERIES
    (   MIN (CEIL (g.prize_x / g.button_a_x),  -- can't overrun prize
             CEIL (g.prize_y / g.button_a_y)) + 2
        , 0, -1
    )  AS na
WHERE
    (g.prize_x - g.button_a_x * na.VALUE) / g.button_b_x
        = (g.prize_y - g.button_a_y * na.VALUE) / g.button_b_y
AND
    (g.prize_x - g.button_a_x * na.VALUE) % g.button_b_x = 0
AND
    (g.prize_y - g.button_a_y * na.VALUE) % g.button_b_y = 0
;
Run Time: real 0.001 user 0.000000 sys 0.000190
changes: 1   total_changes: 4

CREATE VIEW best_solution
AS
SELECT
    game_id
,   n
,   m
FROM
(   SELECT
        game_id
    ,   n
    ,   m
    ,   RANK () OVER
        (   PARTITION BY game_id
            ORDER BY
                n * 3 + m * 1  ASC
        )  AS game_rank
    FROM
        solution
)
WHERE
    game_rank = 1
;
Run Time: real 0.000 user 0.000000 sys 0.000101
changes: 1   total_changes: 4

SELECT
    SUM (3 * n + 1 * m)  AS "Part One: Claw Contraption Minimum cost"
FROM
    best_solution
;
┌─────────────────────────────────────────┐
│ Part One: Claw Contraption Minimum cost │
├─────────────────────────────────────────┤
│ 480                                     │
└─────────────────────────────────────────┘
Run Time: real 0.000 user 0.000483 sys 0.000000
changes: 1   total_changes: 4

-- UPDATE game
-- SET
--     prize_x = prize_x + CAST (1E13 AS INT)
-- ,   prize_y = prize_y + CAST (1E13 AS INT)
-- ;
--
-- SELECT
--     SUM (3 * n + 1 * m)  AS "Part Two: Claw Contraption Minimum cost"
-- FROM
--     best_solution
-- ;
--

.stats
Memory Used:                         88368 (max 205568) bytes
Number of Outstanding Allocations:   286 (max 420)
Number of Pcache Overflow Bytes:     16960 (max 25168) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       641
Lookaside failures due to size:      7
Lookaside failures due to OOM:       192
Pager Heap Usage:                    13608 bytes
Page cache hits:                     22
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   9440 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            22771
Bytes sent to write():               2670
Read() system calls:                 38
Write() system calls:                26
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0

CREATE TABLE game
(   game_id             INT
,   button_a_x          INT
,   button_a_y          INT
,   button_b_x          INT
,   button_b_y          INT
,   prize_x             INT
,   prize_y             INT
);
Run Time: real 0.000 user 0.000238 sys 0.000000
changes: 0   total_changes: 0

.import --csv '| awk -f load-game.awk $LOAD_FILE' game
SELECT COUNT (*) FROM game;
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 320       │
└───────────┘
Run Time: real 0.000 user 0.000021 sys 0.000000
changes: 1   total_changes: 320

CREATE VIEW solution
AS
SELECT
    g.game_id
,   na.VALUE  AS n
,   (g.prize_x - g.button_a_x * na.VALUE) / g.button_b_x  AS m
FROM
    game  AS g
CROSS JOIN
    GENERATE_SERIES
    (   MIN (CEIL (g.prize_x / g.button_a_x),  -- can't overrun prize
             CEIL (g.prize_y / g.button_a_y)) + 2
        , 0, -1
    )  AS na
WHERE
    (g.prize_x - g.button_a_x * na.VALUE) / g.button_b_x
        = (g.prize_y - g.button_a_y * na.VALUE) / g.button_b_y
AND
    (g.prize_x - g.button_a_x * na.VALUE) % g.button_b_x = 0
AND
    (g.prize_y - g.button_a_y * na.VALUE) % g.button_b_y = 0
;
Run Time: real 0.000 user 0.000119 sys 0.000036
changes: 1   total_changes: 320

CREATE VIEW best_solution
AS
SELECT
    game_id
,   n
,   m
FROM
(   SELECT
        game_id
    ,   n
    ,   m
    ,   RANK () OVER
        (   PARTITION BY game_id
            ORDER BY
                n * 3 + m * 1  ASC
        )  AS game_rank
    FROM
        solution
)
WHERE
    game_rank = 1
;
Run Time: real 0.000 user 0.000054 sys 0.000027
changes: 1   total_changes: 320

SELECT
    SUM (3 * n + 1 * m)  AS "Part One: Claw Contraption Minimum cost"
FROM
    best_solution
;
┌─────────────────────────────────────────┐
│ Part One: Claw Contraption Minimum cost │
├─────────────────────────────────────────┤
│ 34393                                   │
└─────────────────────────────────────────┘
Run Time: real 0.007 user 0.006122 sys 0.000000
changes: 1   total_changes: 320

-- UPDATE game
-- SET
--     prize_x = prize_x + CAST (1E13 AS INT)
-- ,   prize_y = prize_y + CAST (1E13 AS INT)
-- ;
--
-- SELECT
--     SUM (3 * n + 1 * m)  AS "Part Two: Claw Contraption Minimum cost"
-- FROM
--     best_solution
-- ;
--

.stats
Memory Used:                         97136 (max 218432) bytes
Number of Outstanding Allocations:   288 (max 422)
Number of Pcache Overflow Bytes:     25712 (max 33920) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       3659
Lookaside failures due to size:      7
Lookaside failures due to OOM:       192
Pager Heap Usage:                    22312 bytes
Page cache hits:                     473
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   9472 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            51703
Bytes sent to write():               10931
Read() system calls:                 45
Write() system calls:                28
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0
#+end_example
